---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalSystem.WireSizeString
source: html/51fad9c3-b6a4-a8b3-95b2-beafff72f994.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalSystem.WireSizeString Property

The WireSize as a String of the Electrical System

## Syntax (C#)
```csharp
public string WireSizeString { get; }
```

## Remarks
This property is used to retrieve the WireSize String of the Electrical System.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - This property only available when System Type is Power!